import React from 'react';

export default function Story() {
  return (
    <div className="story" id='#story'>
      <h2 className="about__title">История</h2>
      <div className="about__line"></div>
      <div className="story__grid">
        <div className="story__grid-img"></div>
        <p className="story__grid-text1">Енисейск издревле был экономическим, культурным и&nbsp;промышленным центром 
        Сибири за&nbsp;счет своего расположения. Этот острог притягивал купцов, ремесленников и&nbsp;ямщиков. 
        Более того, идущие вглубь Сибири вынуждены были оставаться на&nbsp;зиму в&nbsp;этом городе. Таким образом 
        он&nbsp;стал собирать подле себя людей всех вероисповеданий, в&nbsp;том числе и&nbsp;мусульман. В&nbsp;ходе своего развития 
        он&nbsp;стал центром духовной жизни для&nbsp;всех единоверцев края, и&nbsp;с&nbsp;1724&nbsp;года он&nbsp;стал уже главным городом 
        Енисейской провинции, входящей  в&nbsp;состав Тобольской губернии&nbsp;– притягательного для мусульман всей 
        Северной Азии центра духовного влияния, где жили высшие по&nbsp;иерархии ахуны, способные разрешать брачные 
        и&nbsp;наследные дела по&nbsp;шариату.</p>
        <p className="story__grid-text2">С 1804 года город и&nbsp;уезд были подчинены Томской губернии, где местные 
        мусульмане занимали разные ступени социальной лестницы, обладая большим влиянием в&nbsp;органах власти. Всё 
        это способствовало развитию мусульманства в Енисейске. 29&nbsp;февраля 1892&nbsp;года Енисейское губернское 
        правление разрешило мусульманскому обществу постройку соборной мечети по&nbsp;представленному проекту, 
        разработанному в&nbsp;строительном отделении города. Изменения в&nbsp;проект здания были внесены губернатором 
        Теляковским и&nbsp;губернским инженером Павловым. Судя по&nbsp;всему, сама постройка была осуществлена несколько 
        позднее, так&nbsp;как на&nbsp;плане Енисейска от&nbsp;1896&nbsp;г. мечеть еще не&nbsp;показана.</p>
        <p className="story__grid-text3">Здание мечети было выстроено во&nbsp;2-м&nbsp;участке, 66-м&nbsp;квартале города, 
        на&nbsp;южной стороне Новонаименованной улицы, ныне ул.Бограда, поблизости от&nbsp;пересечения ее Бассейным 
        переулком, ныне ул.Бабкина. Сама мечеть датируется 1892 годом и&nbsp;считается самой «старшей» мечетью 
        в&nbsp;Красноярском крае, а&nbsp;также единственной построенной из&nbsp;кирпичной кладки до&nbsp;1917&nbsp;года.</p>
      </div>
      <div className="story__flex">
        <p className="story__flex-text">К сожалению её&nbsp;постигла ужасная участь. Так в&nbsp;1930-х&nbsp;годах, в&nbsp;связи 
        с&nbsp;приходом советской власти и&nbsp;изданием указа о&nbsp;искоренении религии в&nbsp;стране, она была закрыта на&nbsp;несколько 
        лет, а&nbsp;в&nbsp;1950-х&nbsp;годах с&nbsp;помощью тяжелой техники и&nbsp;вовсе был снесен минарет мечети, после чего из&nbsp;неё 
        сделали цех енисейского деревообрабатывающего комбината, а&nbsp;затем здесь разместилась столярная мастерская. 
        На&nbsp;протяжении десятилетий вместо вознесения молитв здесь строгали доски и&nbsp;делали мебель, но&nbsp;этой 
        несправедливости был положен конец.</p>
        <div className="story__flex-img"></div>
      </div>
      <div className="story__solo">
        <p className="story__solo-text">Спустя более 60&nbsp;лет с&nbsp;уничтожения минарета мечеть была восстановлена 
        к&nbsp;400-летию Енисейска в&nbsp;2019 году, и&nbsp;на&nbsp;сегодняшний день она&nbsp;вновь открыта для&nbsp;молитв. С&nbsp;точки зрения 
        важности объекта в&nbsp;истории региона мечеть считается уникальным памятником культовой мусульманской 
        архитектуры конца XIX&nbsp;века и&nbsp;служит интересным примером небольшого магометанского храма, выполненного 
        в&nbsp;формах архитектурной эклектики.</p>
      </div>
    </div>
  );
}
